import React, { useState, useEffect } from 'react';
import './hero.css'
import Prayer from '../prayer/Prayer';

const Hero= () => {

  const [sypat, setSypat] = useState([
    {}
  ])

  
  const [naasat, setNaasat] = useState([
    {description: 'Алган илимиң бул дүйнөдө да, акыретте да пайдалуу болуусу үчүн өзүңдү жана башкаларды дагы көзөмөлгө алгын.'},
    {description: 'Көчөдө жана мечитте тамактанбагын, Жолдун боюндагы көлмө менен агын суулардан ичпегин. Жолдун ортосуна олтурбагын. Олтурууга мажбур болсоң, мечиттерге барып отургун. Дүкөндөрдө да отурбагын.'},
    {description: 'Жаштыгында ар дайым илим менен алектенгин. себеби, жаштык - зээндин таза кези.'},
    {description: 'Эч кимди төмөн көрбөгүн. өз салабаттуулугуңду сактаганың сыяктуу эле башка адамдардын бедели менен кадыр-баркын коргогун.'},
    {description: 'Илимдин жемиштери сенде байкалуусу үчүн башкалардын ибадаттарынан да көп ибадат кылууга аракетенгин' },
    {description: 'Он жыл бою кирешең, азык-түлүгүң жок калсаң да, эч качан илимден кол үзбөгүн. Себеби, илимден жүз үйүрсөң, жашоо-турмушта машакаттарга тушугасың'},
    {description: 'Өлүмдү көп эстегин'},
    {description: 'Колуңдагы дүнүйөңө жана мансабыңа ишенбегин. Анткени, булардын баары тууралуу Алла Таала сени суракка тартат.'},
  ]);


  return (
    <div className='container ' >
      <Prayer/>
      <h1>Имам Абу Ханифанын наасаттары</h1>
      <div className='cards'>
        {naasat.map((item, index) => (
          <div key={index} className='naasat-card'>
            <p>{item.description}</p>
          </div>  
        ))}
      </div>
    </div>
  );
}

export default Hero;
